### Selecting Data

In [2]:
import pandas as pd

In [6]:
data = {
    'student_id': [98, 101, 138, 5],
    'name': ['Ashu', 'Will', 'Rahul', 'Henny'],
    'age': [10, 9, 7, 12]
}
df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)
print("\n" + "*"*30 + "\n")

Original DataFrame:
   student_id   name  age
0          98   Ashu   10
1         101   Will    9
2         138  Rahul    7
3           5  Henny   12

******************************

In [8]:
df

   student_id   name  age
0          98   Ashu   10
1         101   Will    9
2         138  Rahul    7
3           5  Henny   12

##### 1. Selecting a Single Column

In [14]:
df_names = df['name']
print("Selecting the 'name' column:")
print(df_names)

Selecting the 'name' column:
0     Ashu
1     Will
2    Rahul
3    Henny
Name: name, dtype: object

In [18]:
print("\nType of 'names':", type(df_names))
print("\n" + "="*30 + "\n")

Type of 'names': <class 'pandas.core.series.Series'>

==============================

In [20]:
# Using dot notation (works if column name is a valid Python identifier and not conflicting with DataFrame methods)
df_ages = df.age
print("Selecting the 'age' column using dot notation:")
print(df_ages)
print("\n" + "="*30 + "\n")

Selecting the 'age' column using dot notation:
0    10
1     9
2     7
3    12
Name: age, dtype: int64

==============================

##### 2. Selecting Multiple Columns

In [25]:
df_names_multiple = df[['name', 'age']]
print("Selecting the 'name' column:")
print(df_names_multiple)

Selecting the 'name' column:
    name  age
0   Ashu   10
1   Will    9
2  Rahul    7
3  Henny   12

In [27]:
print("\nType of 'df_names_multiple':", type(df_names_multiple))
print("\n" + "="*30 + "\n")

Type of 'df_names_multiple': <class 'pandas.core.frame.DataFrame'>

==============================

##### 3. Selecting Rows by Index (Labels or Positions)

In [32]:
# Pandas provides two primary indexers for selecting rows: .loc and .iloc.

In [44]:
# 1. Using .loc (by label/index)  selecting single rows
row_1_loc_single = df.loc[1]
print("Selecting row with label 1 using .loc:")
print(row_1_loc_single)
print("\n" + "="*30 + "\n")

Selecting row with label 1 using .loc:
student_id     101
name          Will
age              9
Name: 1, dtype: object

==============================

In [48]:
# 2. Using .iloc (by integer position)
# Selecting a single row by its integer position  
row_1_iloc_int = df.iloc[1]
print("Selecting row at position 1 (second row) using .iloc:")
print(row_1_iloc_int)
print("\n" + "="*30 + "\n")

Selecting row at position 1 (second row) using .iloc:
student_id     101
name          Will
age              9
Name: 1, dtype: object

==============================